Ran Plan for dir: `.` workspace: `default`

<details><summary>Show Output</summary>

```diff
08:58:08.187 INFO   Downloading Terraform configurations from file:///home/ec2-user/.atlantis/repos/amitkarpe/atlantis-test/15/default into /home/ec2-user/.atlantis/repos/amitkarpe/atlantis-test/15/default/.terragrunt-cache/NIxP4CnB6NyWArMMrWwAn5uP49g/94L9FtUqOi2mI3xu-vftdOJ_X-Y
08:58:08.420 STDOUT terraform: Initializing the backend...
08:58:08.521 STDOUT terraform: Successfully configured the backend "s3"! Terraform will automatically
08:58:08.521 STDOUT terraform: use this backend unless the backend configuration changes.
08:58:08.590 STDOUT terraform: Initializing provider plugins...
08:58:08.590 STDOUT terraform: - Reusing previous version of hashicorp/random from the dependency lock file
08:58:08.611 STDOUT terraform: - Reusing previous version of hashicorp/aws from the dependency lock file
08:58:08.701 STDOUT terraform: - Using hashicorp/random v3.6.3 from the shared cache directory
08:58:10.860 STDOUT terraform: - Using hashicorp/aws v5.69.0 from the shared cache directory
08:58:15.024 STDOUT terraform: Terraform has been successfully initialized!
08:58:15.024 STDOUT terraform: You may now begin working with Terraform. Try running "terraform plan" to see
08:58:15.024 STDOUT terraform: any changes that are required for your infrastructure. All Terraform commands
08:58:15.024 STDOUT terraform: should now work.
08:58:15.024 STDOUT terraform: If you ever set or change modules or backend configuration for Terraform,
08:58:15.024 STDOUT terraform: rerun this command to reinitialize your working directory. If you forget, other
08:58:15.024 STDOUT terraform: commands will detect it and remind you to do so if necessary.
08:58:20.215 STDOUT terraform: random_pet.bucket_name: Refreshing state... [id=unduly-eminent-primate]
08:58:20.487 STDOUT terraform: aws_s3_bucket.test_bucket: Refreshing state... [id=atlantis-terragrunt-test-unduly-eminent-primate]
08:58:21.054 STDOUT terraform: Terraform used the selected providers to generate the following execution
08:58:21.054 STDOUT terraform: plan. Resource actions are indicated with the following symbols:
08:58:21.054 STDOUT terraform: -/+ destroy and then create replacement
08:58:21.054 STDOUT terraform: Terraform will perform the following actions:
08:58:21.054 STDOUT terraform:   # aws_s3_bucket.test_bucket must be replaced
08:58:21.054 STDOUT terraform: -/+ resource "aws_s3_bucket" "test_bucket" {
08:58:21.054 STDOUT terraform:       + acceleration_status         = (known after apply)
08:58:21.054 STDOUT terraform:       + acl                         = (known after apply)
08:58:21.054 STDOUT terraform:       ~ arn                         = "arn:aws:s3:::atlantis-terragrunt-test-unduly-eminent-primate" -> (known after apply)
08:58:21.054 STDOUT terraform:       ~ bucket                      = "atlantis-terragrunt-test-unduly-eminent-primate" -> (known after apply) # forces replacement
08:58:21.054 STDOUT terraform:       ~ bucket_domain_name          = "atlantis-terragrunt-test-unduly-eminent-primate.s3.amazonaws.com" -> (known after apply)
08:58:21.054 STDOUT terraform:       + bucket_prefix               = (known after apply)
08:58:21.054 STDOUT terraform:       ~ bucket_regional_domain_name = "atlantis-terragrunt-test-unduly-eminent-primate.s3.ap-southeast-1.amazonaws.com" -> (known after apply)
08:58:21.054 STDOUT terraform:       ~ hosted_zone_id              = "Z3O0J2DXBE1FTB" -> (known after apply)
08:58:21.054 STDOUT terraform:       ~ id                          = "atlantis-terragrunt-test-unduly-eminent-primate" -> (known after apply)
08:58:21.054 STDOUT terraform:       ~ object_lock_enabled         = false -> (known after apply)
08:58:21.054 STDOUT terraform:       + policy                      = (known after apply)
08:58:21.054 STDOUT terraform:       ~ region                      = "ap-southeast-1" -> (known after apply)
08:58:21.054 STDOUT terraform:       ~ request_payer               = "BucketOwner" -> (known after apply)
08:58:21.054 STDOUT terraform:       - tags                        = {} -> null
08:58:21.054 STDOUT terraform:       ~ tags_all                    = {} -> (known after apply)
08:58:21.054 STDOUT terraform:       + website_domain              = (known after apply)
08:58:21.054 STDOUT terraform:       + website_endpoint            = (known after apply)
08:58:21.054 STDOUT terraform:         # (1 unchanged attribute hidden)
08:58:21.054 STDOUT terraform:       ~ cors_rule (known after apply)
08:58:21.055 STDOUT terraform:       ~ grant (known after apply)
08:58:21.055 STDOUT terraform:       - grant {
08:58:21.055 STDOUT terraform:           - id          = "9f83ffd5bd78abb53e8b9de59f80f4efce23bffeeef98c1cab7e0b3e28cabbd4" -> null
08:58:21.055 STDOUT terraform:           - permissions = [
08:58:21.055 STDOUT terraform:               - "FULL_CONTROL",
08:58:21.055 STDOUT terraform:             ] -> null
08:58:21.055 STDOUT terraform:           - type        = "CanonicalUser" -> null
08:58:21.055 STDOUT terraform:             # (1 unchanged attribute hidden)
08:58:21.055 STDOUT terraform:         }
08:58:21.055 STDOUT terraform:       ~ lifecycle_rule (known after apply)
08:58:21.055 STDOUT terraform:       ~ logging (known after apply)
08:58:21.055 STDOUT terraform:       ~ object_lock_configuration (known after apply)
08:58:21.055 STDOUT terraform:       ~ replication_configuration (known after apply)
08:58:21.055 STDOUT terraform:       ~ server_side_encryption_configuration (known after apply)
08:58:21.055 STDOUT terraform:       - server_side_encryption_configuration {
08:58:21.055 STDOUT terraform:           - rule {
08:58:21.055 STDOUT terraform:               - bucket_key_enabled = false -> null
08:58:21.055 STDOUT terraform:               - apply_server_side_encryption_by_default {
08:58:21.055 STDOUT terraform:                   - sse_algorithm     = "AES256" -> null
08:58:21.055 STDOUT terraform:                     # (1 unchanged attribute hidden)
08:58:21.055 STDOUT terraform:                 }
08:58:21.055 STDOUT terraform:             }
08:58:21.055 STDOUT terraform:         }
08:58:21.055 STDOUT terraform:       ~ versioning (known after apply)
08:58:21.055 STDOUT terraform:       - versioning {
08:58:21.055 STDOUT terraform:           - enabled    = false -> null
08:58:21.055 STDOUT terraform:           - mfa_delete = false -> null
08:58:21.055 STDOUT terraform:         }
08:58:21.055 STDOUT terraform:       ~ website (known after apply)
08:58:21.055 STDOUT terraform:     }
08:58:21.055 STDOUT terraform:   # random_pet.bucket_name must be replaced
08:58:21.055 STDOUT terraform: -/+ resource "random_pet" "bucket_name" {
08:58:21.055 STDOUT terraform:       ~ id        = "unduly-eminent-primate" -> (known after apply)
08:58:21.055 STDOUT terraform:       ~ length    = 3 -> 4 # forces replacement
08:58:21.055 STDOUT terraform:         # (1 unchanged attribute hidden)
08:58:21.055 STDOUT terraform:     }
08:58:21.055 STDOUT terraform: Plan: 2 to add, 0 to change, 2 to destroy.
08:58:21.055 STDOUT terraform: ─────────────────────────────────────────────────────────────────────────────
08:58:21.055 STDOUT terraform: Note: You didn't use the -out option to save this plan, so Terraform can't
08:58:21.055 STDOUT terraform: guarantee to take exactly these actions if you run "terraform apply" now.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d .
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://54.151.149.180:4141/lock?id=amitkarpe%252Fatlantis-test%252F.%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d .
  ```
Plan: 2 to add, 0 to change, 2 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```